cask_args appdir: '/Applications'

# Core applications
cask 'avast-security'
cask 'dropbox'
cask 'handbrake'
cask 'malwarebytes'
cask 'transmission'

# Chat applications
cask 'signal'
cask 'skype'
cask 'whatsapp'
# cask 'viber'

# Developer applications
cask 'charles'
cask 'cyberduck'
cask 'docker'
cask 'firefox --language=en-GB'
cask 'firefox-developer-edition --language=en-GB'
cask 'insomnia'
cask 'virtualbox'
#cask 'sublime-text'

# Entertainment applications
cask 'marshallofsound-google-play-music-player'
cask 'mplayer-osx-extended'

# Mac App Store
mas '1Password', id: 443987910
mas 'Xcode', id: 497799835