cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'

brew 'ack'
brew 'coreutils'
brew 'ctags'
brew 'doxygen'
brew 'ffmpeg'
brew 'grc'
brew 'http-server'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'mackup'
brew 'mas'
brew 'n'
brew 'neovim'
brew 'node'
brew 'readline'
brew 'roundup'
brew 'tmux'
brew 'trash'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zplug'
#brew 'go'
#brew 'postgresql'
#brew 'spaceman-diff'

# Java
#cask 'java'
#brew 'maven'

# Python
brew 'python'
brew 'python3'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Fonts
cask 'caskroom/fonts/font-hack'
cask 'rocket'

# Core applications
cask 'avast-security'
cask 'google-chrome'
cask 'handbrake'
cask 'malwarebytes'
cask 'quicksilver'
cask 'the-unarchiver'
cask 'transmission'
#cask 'aerial'
#cask 'alfred'
#cask 'appcleaner'
#cask 'bartender'
#cask 'bee'
#cask 'contexts'
#cask 'evernote'
#cask 'flux'
#cask 'hazel'
#cask 'hyperdock'
#cask 'kindle'
#cask 'nordvpn'
#cask 'seil'
#cask 'spectacle'
#cask 'transmit'

# Design tools
#cask 'invisionsync'
#cask 'sketch'
#cask 'xscope'
#cask 'zeplin'

# File storage
cask 'dropbox'
cask 'google-backup-and-sync'

# Chat applications
cask 'signal'
cask 'skype'
cask 'slack'
cask 'viber'
cask 'whatsapp'
#cask 'yakyak'

# Music applications
#cask 'beardedspice'
#cask 'radiant-player'
#cask 'soundcleod'

# Entertainment applications
cask 'marshallofsound-google-play-music-player'
cask 'vlc'
cask 'mplayer-osx-extended'
#cask 'deluge'
#cask 'google-plus-auto-backup'
#cask 'jadengeller-helium'
#cask 'music-manager'
#cask 'plex-media-server'
#cask 'subtitles'

# Developer Applications
cask 'charles'
cask 'cyberduck'
cask 'docker'
cask 'firefox --language=en-GB'
cask 'homebrew/cask-versions/firefox-developer-edition --language=en-GB'
cask 'insomnia'
cask 'iterm2'
cask 'sublime-text'
cask 'virtualbox'
cask 'visual-studio-code'
#cask 'dash'
#cask 'datagrip'
#cask 'gitup'
#cask 'go2shell'
#cask 'kaleidoscope'
#cask 'marked'
#cask 'parallels-desktop'
#cask 'paw'
#cask 'tower'
#cask 'webstorm'

# Mas
mas '1Password', id: 443987910
mas 'Battery Monitor: Health, Info', id: 836505650
mas 'BetterSnapTool', id: 417375580
mas 'WeChat', id: 836500024
mas 'Xcode', id: 497799835
#mas 'Xcode', id: 497799835
#mas 'Fantastical 2', id: 975937182
#mas 'Airmail 3', id: 918858936
#mas 'Reeder 3', id: 880001334
#mas 'Paste – smart clipboard history & snippets manager', id: 967805235
#mas 'Noizio', id: 928871589
#mas 'HazeOver • Distraction Dimmer', id: 430798174
#mas 'SnippetsLab', id: 1006087419
#mas 'Deliveries: a package tracker', id: 924726344
#mas 'Be Focused Pro - Focus Timer & Goal Tracker', id: 961632517
#mas 'Patterns - The Regex App', id: 429449079
#mas 'DaisyDisk', id: 411643860
#mas 'Moom', id: 419330170
#mas 'ForkLift - File Manager and FTP/SFTP/WebDAV/Amazon S3 client', id: 412448059
