cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'

brew 'ack'
brew 'coreutils'
brew 'ctags'
brew 'doxygen'
brew 'ffmpeg'
brew 'grc'
brew 'http-server'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'mackup'
brew 'mas'
brew 'n'
brew 'neovim'
brew 'node'
brew 'readline'
brew 'roundup'
brew 'tmux'
brew 'trash'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zplug'
#brew 'go'
#brew 'postgresql'
#brew 'spaceman-diff'

# Java
#cask 'java'
#brew 'maven'

# Python
brew 'python'
brew 'python3'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Fonts
cask 'caskroom/fonts/font-hack'

# Core applications
cask 'google-chrome'
cask 'quicksilver'
cask 'the-unarchiver'
#cask 'aerial'
#cask 'alfred'
#cask 'appcleaner'
#cask 'bartender'
#cask 'bee'
#cask 'contexts'
#cask 'evernote'
#cask 'flux'
#cask 'hazel'
#cask 'hyperdock'
#cask 'kindle'
#cask 'nordvpn'
#cask 'seil'
#cask 'spectacle'
#cask 'transmit'

# File storage
cask 'google-backup-and-sync'

# Chat applications
cask 'slack'

# Entertainment applications
cask 'vlc'

# Developer Applications
cask 'iterm2'
cask 'visual-studio-code'

# Mac App Store
mas 'Battery Monitor: Health, Info', id: 836505650
mas 'BetterSnapTool', id: 417375580
mas 'WeChat', id: 836500024
